# Statistics utility to count lines of code
brew "cloc"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Configurable static site generator
brew "hugo"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Dependency manager that installs and runs Swift command-line tool packages
brew "mint"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Formatting technology for Swift source code
brew "swift-format"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Tool to parse the SLF serialization format used by Xcode
brew "xclogparser"
# Android SDK component
cask "android-platform-tools"
cask "font-fira-code"
# Get up and running with large language models locally
cask "ollama-app"
# Install and switch between multiple versions of Xcode
cask "xcodes-app"
vscode "budparr.language-hugo-vscode"
vscode "davidanson.vscode-markdownlint"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "nickeolofsson.remember-mcp-vscode"
vscode "numso.prettier-standard-vscode"
vscode "openai.chatgpt"
vscode "swiftlang.swift-vscode"
