# Statistics utility to count lines of code
brew "cloc"
# GitHub command-line tool
brew "gh"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Configurable static site generator
brew "hugo"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Mac App Store command-line interface
brew "mas"
# Dependency manager that installs and runs Swift command-line tool packages
brew "mint"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Formatting technology for Swift source code
brew "swift-format"
# Formatting tool for reformatting Swift code
brew "swiftformat"
# Tool to enforce Swift style and conventions
brew "swiftlint"
# Tool to parse the SLF serialization format used by Xcode
brew "xclogparser"
# Android SDK component
cask "android-platform-tools"
cask "font-fira-code"
# Get up and running with large language models locally
cask "ollama-app"
# Install and switch between multiple versions of Xcode
cask "xcodes-app"
mas "1Blocker", id: 1365531024
mas "AusweisApp", id: 948660805
mas "Bitwarden", id: 1352778147
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Dark Mode for Safari", id: 1397180934
mas "DevCleaner", id: 1388020431
mas "Flighty", id: 1358823008
mas "Folder Quick Look", id: 6753110395
mas "GarageBand", id: 682658836
mas "Home Assistant", id: 1099568401
mas "Infuse", id: 1136220934
mas "Keynote", id: 409183694
mas "Live Home 3D", id: 1066144116
mas "NordVPN", id: 905953485
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "RocketSim", id: 1504940162
mas "Shapr3D", id: 1091675654
mas "Telegram", id: 747648890
mas "TestFlight", id: 899247664
mas "WhatsApp", id: 310633997
mas "Xcode", id: 497799835
mas "xcsort", id: 1153337296
vscode "budparr.language-hugo-vscode"
vscode "davidanson.vscode-markdownlint"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "nickeolofsson.remember-mcp-vscode"
vscode "numso.prettier-standard-vscode"
vscode "openai.chatgpt"
vscode "swiftlang.swift-vscode"
