budparr.language-hugo-vscode
davidanson.vscode-markdownlint
esbenp.prettier-vscode
github.copilot
github.copilot-chat
github.vscode-github-actions
llvm-vs-code-extensions.lldb-dap
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.remote-explorer
ms-vscode.remote-server
nickeolofsson.remember-mcp-vscode
numso.prettier-standard-vscode
openai.chatgpt
swiftlang.swift-vscode
